app/controllers/api/v1/posts_controller.rb

  def create
    @post = current_user.posts.build(post_params)

    if @post.save
---
INSERT INTO "posts" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "post"], ["body", nil], ["user_id", 1], ["created_at", "2023-03-15 10:40:52.183873"], ["updated_at", "2023-03-15 10:40:52.183873"]]

  def show
    post = current_user.posts.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ? AND "posts"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]

  def update
    post = current_user.posts.find(params[:id])
    if post.update(post_params)
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ? AND "posts"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "richie"], ["body", "rich"], ["updated_at", "2023-03-15 10:59:35.529970"], ["id", 1]]

  def destroy
    post = current_user.posts.find(params[:id])

    post.destroy
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ? AND "posts"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 3]]