app/controllers/api/v1/sessions_controller.rb

  def load_user
    @user = User.find_for_database_authentication(email: sign_in_params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? ORDER BY "users"."id" ASC LIMIT ?  [["email", "abc@example.com"], ["LIMIT", 1]]